Repository: Andrej730/boltsparts
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: de

source: BOLTS is an Open Library of Technical Specifications.
de: BOLTS ist eine offene Bibliothek für technische Spezifikationen.

source: What is BOLTS?
de: Was ist BOLTS?

source: The aim of BOLTS is to build a free and open-source standard parts library for CAD applications. It does so by providing a common database that can be utilized by many different CAD applications.
de: Das Ziel von BOLTS ist es, eine freie und quelloffene Standardteilebibliothek für CAD Applikationen aufzubauen. BOLTS tut dies, indem es eine gemeinsame Datenbasis bereitstellt, die von verschiedenen CAD Programmen aus genutzt werden kann.

source: What is a standard parts library?
de: Was ist eine Standardteilebibliothek?

source: When you use a CAD software to create a design, this design consists usually of two different types of components: Custom parts that are specific to your purposes and have to be custom made (e.g. by 3D printing), and standard parts like nuts and bolts that you can buy in a hardware store.
de: Wenn man eine CAD Software verwendet um ein Objekt zu konstruieren, dann besteht dieses normalerweise aus zwei Sorten von Komponenten: Spezialteile, die spezifisch für diese Anwendung sind, und die selbst hergestellt werden müssen (z.B. mit einem 3D Drucker), und Standardteile, wie Schrauben und Muttern, die man im Laden kaufen kann.

source: A standard parts library relieves you from the tedious task of modeling standard parts by providing them readily usable, so that you can focus on the interesting aspects of your design.
de: Eine Standardteilebibliothek nimmt einem das langwierige Modellieren von Standardteilen ab, indem es diese sofort nutzbar bereitstellt. Dadurch kann man sich auf die interessanten Aspekte eines Designs konzentrieren.

source: While many commercial vendors offer standard parts libraries with their tools or for a fee, there is no free (as in freedom) standard parts library, yet. BOLTS tries to fill this gap.
de: Während viele Firmen Standardteilebibliotheken für kommerzielle Software anbieten, gibt es bisher keine, die frei ist (wie in Freiheit).

source: How does BOLTS work?
de: Wie funktioniert BOLTS?

source: BOLTS leverages the parametric abilities that most CAD applications provide. This allows to obtain a huge number of different sizes and variants of a part from a single model.
de: BOLTS nutzt die parametrischen Funktionen, die die meisten CAD Programme bereitstellen. Das erlaubt es, eine große Zahl von verschiedenen Größen und Varianten von einem einzelnen Modell abzuleiten.

source: Dimensions and metadata of all the sizes and versions of the part are kept in special files. BOLTS can then use this data and the parametric models of the parts to automatically build standard parts libraries ("BOLTS for ...") for different CAD tools, that the user just can simply download and use
de: Abmessungen und Metadaten für alle Größen und Versionen eines Teils sind in speziellen Dateien verfügbar. BOLTS can diese Daten zusammen mit den parametrischen Modellen dazu nutzen, automatisch Standardteilebibliotheken ("BOLTS für ...") verschiedene CAD programme zu erstellen, die der Benutzer einfach herunterladen und verwenden kann.

source: So in a sense BOLTS is a tool to create standard parts libraries.
de: BOLTS ist also in einem gewissen Sinne ein Werkzeug zur Erstellung von Standardteilebibliotheken.

source: How can I help?
de: Wie kann ich mithelfen?

source: You can help BOLTS by modeling parts in one of the supported CAD tools, by adding dimensions and metadata for new parts, or by creating drawings for the <a href="%(url)s">online part directory</a>.
de: Du kannst bei BOLTS mithelfen, indem du Teile in einem der unterstützten CAD Programmen modellierst, Abmessungen und Metadaten für neue Teile hinzufügst oder Zeichnungen für das <a href="%(url)s">Teileverzeichnis</a> erstellst.

source: These tasks are relatively easy, and most of them do not require programming skills. To learn more, check out <a href="%(url)s">this page</a>, it has more information and links to detailed descriptions of the different tasks.
de: Diese Aufgaben sind relativ einfach, und die meisten erfordern keine Programmierkenntnisse. Um mehr zu erfahren, besuche <a href="%(url)s">diese Seite</a> mit weiteren Informationen und Links zu detaillierten Beschreibungen der verschiedenen Aufgaben.

source: Statistics
de: Statistiken

source: Author
de: Autor

source: License
de: Lizenz

source: Collection
de: Kollektion

source: Identical to
de: Identisch mit

source: Standard body
de: Standardisierungsbehörde

source: Replaces
de: Ersetzt

source: Replaced by
de: Ersetzt durch

source: Source
de: Quellen

source: Description
de: Beschreibung

source: Location
de: Ort

source: Drawing
de: Zeichnung

source: Specifications by %(body)s
de: Spezifikationen von %(body)s

source: Collections
de: Kollektionen

source: Standardisation bodies
de: Standardisierungsbehörden

source: Drawings
de: Zeichnungen

source: Parameters
de: Parameter

source: This part is not availaible for FreeCAD
de: Dieses Teil ist für FreeCAD nicht verfügbar

source: Incantations
de: Aufruf

source: Connectors
de: Konnektoren

source: This part is not availaible for OpenSCAD
de: Dieses Teil ist für OpenSCAD nicht verfügbar

source: Tables
de: Tabellen
